scripts/bzt/DIGITALBANK_USER_PROFILE-Combined-JMeter.yaml

# Script generated by Blazemeter Chrome Extension

modules:
  nose:
    ignore-unknown-actions: true

execution:

- executor: jmeter
  scenario: DIGITALBANK_USER_PROFILE-Http
  concurrency: 1
  ramp-up: 30s
  hold-for: 30s

scenarios:

  DIGITALBANK_USER_PROFILE-Http:
    headers:
      User-Agent: 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/87.0.4280.141 Safari/537.36'
    requests:
      - transaction: Login
        force-parent-sample: false
        do:
          - url: 'http://localhost:8888/bank/login'
            method: GET
            label: 'http://localhost:8888/bank/login'
            think-time: 0ms
            headers:
              Upgrade-Insecure-Requests: '1'
              Accept: 'text/html,application/xhtml+xml,application/xml;q=0.9,image/avif,image/webp,image/apng,*/*;q=0.8,application/signed-exchange;v=b3;q=0.9'
          - url: 'http://localhost:8888/bank/login'
            method: POST
            label: 'http://localhost:8888/bank/login'
            think-time: 13721ms
            headers:
              Upgrade-Insecure-Requests: '1'
              Content-Type: application/x-www-form-urlencoded
              Accept: 'text/html,application/xhtml+xml,application/xml;q=0.9,image/avif,image/webp,image/apng,*/*;q=0.8,application/signed-exchange;v=b3;q=0.9'
            body:
              password: 'Demo123!'
              username: jsmith@demo.io
      - transaction: Click Profile
        force-parent-sample: false
        do:
          - url: 'http://localhost:8888/bank/user/profile'
            method: GET
            label: 'http://localhost:8888/bank/user/profile'
            assert:
              - assume-success: false
                contains:
                  - Josh
                not: false
                regexp: false
                subject: body
            think-time: 23620ms
            headers:
              Upgrade-Insecure-Requests: '1'
              Accept: 'text/html,application/xhtml+xml,application/xml;q=0.9,image/avif,image/webp,image/apng,*/*;q=0.8,application/signed-exchange;v=b3;q=0.9'
      - transaction: Home Page
        force-parent-sample: false
        do:
          - url: 'http://localhost:8888/bank/home'
            method: GET
            label: 'http://localhost:8888/bank/home'
            think-time: 41152ms
            headers:
              Upgrade-Insecure-Requests: '1'
              Accept: 'text/html,application/xhtml+xml,application/xml;q=0.9,image/avif,image/webp,image/apng,*/*;q=0.8,application/signed-exchange;v=b3;q=0.9'
      - transaction: Logout
        force-parent-sample: false
        do:
          - url: 'http://localhost:8888/bank/logout'
            method: GET
            label: 'http://localhost:8888/bank/logout'
            think-time: 11615ms
            headers:
              Upgrade-Insecure-Requests: '1'
              Accept: 'text/html,application/xhtml+xml,application/xml;q=0.9,image/avif,image/webp,image/apng,*/*;q=0.8,application/signed-exchange;v=b3;q=0.9'