scripts/bzt/DIGITALBANK_USER_PROFILE-Combined-Selenium.yaml

# Script generated by Blazemeter Chrome Extension

modules:
  nose:
    ignore-unknown-actions: true
  selenium:
    chromedriver:
      version: 87.0.4280.88
      download-link: https://chromedriver.storage.googleapis.com/87.0.4280.88/chromedriver_win32.zip

execution:
- executor: selenium
  scenario: DIGITALBANK_USER_PROFILE-Selenium
  blazegrid: true

  capabilities:
    browserName: chrome
  hold-for: 5s

scenarios:
  DIGITALBANK_USER_PROFILE-Selenium:
    generate-flow-markers: true
    headless: false
    timeout: 60s
    think-time: 0s
    requests:
    - label: Login
      actions:
      - resizeWindow(1536,665)
      - go(http://localhost:8888/bank/login?logout)
      - clickByID(username)
      - typeByID(username): "jsmith@demo.io"
      - clickByID(password)
      - typeByID(password): "Demo123!"
      - clickByID(submit)
    - label: Click Profile
      actions:
      - clickByCSS(img.user-avatar.rounded-circle)
      - clickByLinkText(My Profile)
      - clickByID(firstName)
      - clickByID(firstName)
      - doubleClickByID(firstName)
      # WARN: Command Not yet supported. ('contextMenuAt:"id=firstName":"34,14"')
      - clickByID(lastName)
      # WARN: Command Not yet supported. ('contextMenuAt:"id=lastName":"99,24"')
    - label: Home Page
      actions:
      - clickByID(home-menu-item)
    - label: Logout
      actions:
      - clickByCSS(img.user-avatar.rounded-circle)
      - clickByLinkText(Logout)
      - clickByCSS(div.sufee-alert.alert.with-close.alert-success.alert-dismissible.fade.show)
      # WARN: Command Not yet supported. ('contextMenuAt:"css=div.sufee-alert.alert.with-close.alert-success.alert-dismissible.fade.show":"163,27"')
      - assertTextByCSS(div.sufee-alert.alert.with-close.alert-success.alert-dismissible.fade.show): "Success Logout completed.\n×"